{
    "businessCard": {
        "name": "Bars Margetsch",
        "tagLine": "Second year software engineer student in Oulu, Finland,",
        "currentlyAt": "at the Oulu University of Applied Sciences",
        "socials": {
            "github": "https://github.com/Xerren09",
            "linkedin": "https://www.linkedin.com/in/bars-margetsch",
            "email": "bars.margetsch@outlook.com"
        }
    },
    "intro" : [
        "I'm currently a student in my second year, studying web and software development at the Oulu University of Applied Sciences.",
        "I enjoy working with all sorts of technologies, be it for small webpages, larger web services, or standalone applications; but especially enjoy working on backend and related services because of the interesting and wide variety of technical challenges they offer.",
        "One of my strengths is problem solving, and building tools and utilities that can be easily used to tackle them.",
        "I'm currently looking for an internship or trainee position, as a part of my course's Practical Training module, to learn the in and outs of professional software development :)",
        "VS Code Pets enjoyer. (Clippy my beloved ❤️)"
    ],
    "skills": [
        {
            "name": "Languages",
            "list": ["C#", "ES6 JavaScript", "Python", "MySQL", "HTML5", "CSS"]
        },
        {
            "name": "Frameworks",
            "list": ["Node", ".NET (C# Console, WinForm)", "React", "Express", "Unity"]
        },
        {
            "name": "Tools",
            "list": ["Visual Studio and Visual Studio Code", "Git and GitHub", "npm", "Unity", "MySQL Workbench", "Postman"]
        },
        {
            "name": "Cloud Services",
            "list": ["Microsoft Azure (App-Service, MySQL)", "Google Firestore"]
        }
    ],
    "education": [
        {
            "name": "Oulu University of Applied Sciences",
            "url" : "https://www.oamk.fi/en/",
            "degree": "Bachelor of Applied Science - BASc, Computer Software Engineering",
            "start": "2020",
            "end": "Present (expected to finish in 2025)",
            "comments" : [
                "Web and mobile app development",
                "Server development (REST APIs, WebSockets, UDP sockets)",
                "Usage of various cloud services and hybrid technologies"
            ]
        }
    ],
    "jobs": [

    ],
    "projects": [
        {
            "type": "github",
            "url": "https://github.com/Xerren09/express-route-loader",
            "comments": [
                "Designed during my second year of university with the goal of simplifying our API building workflow"
            ]
        },
        {
            "type": "github",
            "url": "https://github.com/Xerren09/cloudflare-dynamic-dns"
        },
        {
            "type": "github",
            "url": "https://github.com/Xerren09/EntityEngine",
            "comments": [
                "Originally written during my first year studies where I first met JavaScript, it has evolved quite a lot since:",
                "From a messy, clearly not too familiar-with-javascript version, to a much better, performant, and more elegenant TypeScript version, which properly highlights my work.",
                "Additionally, there are also notes on how and why I changed things between versions, and what I learnt during development."
            ]
        }
    ]
}