{
    "businessCard": {
        "name": "Bars Margetsch",
        "tagLine": "Second year software engineer student in Oulu, Finland,",
        "currentlyAt": "at the Oulu University of Applied Sciences",
        "socials": {
            "github": "https://github.com/Xerren09",
            "linkedin": "https://www.linkedin.com/in/bars-margetsch",
            "email": "bars.margetsch@outlook.com"
        }
    },
    "intro" : [
        "I'm currently a student in my second year, studying web and software development at the Oulu University of Applied Sciences.",
        "I enjoy working with all sorts of technologies, be it for small webpages, larger web services, or standalone applications; but especially enjoy working on backend and related services because of the interesting and wide variety of technical challenges they offer.",
        "One of my strengths is problem solving, and building tools and utilities that can be easily used to tackle them.",
        "I'm currently looking for an internship or trainee position, as a part of my course's Practical Training module, to learn the in and outs of professional software development :)",
        "VS Code Pets enjoyer. (Clippy my beloved ❤️)"
    ],
    "skills": [
        {
            "name": "Languages",
            "list": ["ES6 JavaScript", "C#", "Python", "MySQL", "HTML5", "CSS"]
        },
        {
            "name": "Frameworks",
            "list": ["Node", ".NET (C# Console, WinForm)", "React", "Express", "Unity"]
        },
        {
            "name": "Tools",
            "list": ["Visual Studio and Visual Studio Code", "Git and GitHub", "npm", "MySQL Workbench", "Unity", "Postman"]
        },
        {
            "name": "Cloud Services",
            "list": ["Microsoft Azure (App-Service, MySQL)", "Google Firebase"]
        }
    ],
    "education": [
        {
            "name": "Oulu University of Applied Sciences",
            "link" : "https://www.oamk.fi/en/",
            "degree": "Bachelor of Applied Science - BASc, Computer Software Engineering",
            "start": "2020",
            "end": "Present (expected to finish in 2025)",
            "comments" : [
                "Web and mobile app development",
                "Server development (REST APIs, WebSockets, UDP sockets)",
                "Usage of various cloud services and hybrid technologies"
            ]
        }
    ],
    "jobs": [

    ],
    "projects": [
        {
            "type": "github",
            "link": "https://github.com/Xerren09/express-route-loader",
            "comments": [
                "Designed during my second year of university with the goal of simplifying our API building workflow"
            ]
        },
        {
            "type": "github",
            "link": "https://github.com/Xerren09/cloudflare-dynamic-dns"
        },
        {
            "type": "github",
            "link": "https://github.com/Xerren09/EntityEngine",
            "comments": [
                "Originally written during my first year studies in the second period, where I first met JavaScript.",
                "Given how early and quickly I wrote it, it has massive problems and design issues, however, I learnt a lot from it, and since started completely rewriting it to 'do it properly' this time, with my current knowledge, hence why it's included here :)",
                "The rewrite process is done on the 'V2' branch, where I also take notes on what, how, and why I changed and learnt since. (This is done in my freetime, so it's a slow but steady process.)"
            ]
        }
    ]
}